Revit 2024 API
LoadType Enumeration
 This enum declares types of Loads.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public enum LoadType
Visual Basic
Public Enumeration LoadType
Visual C++
public enum class LoadType
Members
Member name | Description
Point |  Point Load
Line |  Line Load
Area |  Area Load
See Also
Autodesk.Revit.DB.Structure Namespace